Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/openide-omegat.tmx
Source language: en_us
Languages: pt_br

source: Root {0} does not exist.
pt_br: A raiz {0} não existe.

source: Cannot delete root of filesystem {0}.
pt_br: Não é possível excluir a raiz do sistema de arquivos {0}.

source: Cannot rename root of filesystem {0}.
pt_br: Não é possível renomear a raiz do sistema de arquivos {0}.

source: Cannot delete file {0} in {1}.
pt_br: Não é possível excluir arquivo {0} em {1}.

source: Cannot rename file {0} in {1} to {2}.
pt_br: Não é possível renomear o arquivo {0} em {1} para {2}.

source: Filesystem {0} is read-only.
pt_br: O sistema de arquivos {0} é somente leitura.

source: File {0} in {1} is read-only.
pt_br: O arquivo {0} em {1} é somente leitura.

source: Cannot create file {0} because {1} on filesystem {2} is not a folder.
pt_br: Não é possível criar arquivo {0} porque {1} no sistema de arquivos {2} não é uma pasta.

source: Folder {0} already exists in {1}.
pt_br: A pasta {0} já existe em {1}.

source: Cannot create folder {0} in {1}.
pt_br: Não é possivel criar a pasta {0} em {1}.

source: File {0} already exists in {1}.
pt_br: O arquivo {0} já existe em {1}.

source: Cannot create file {2}.{3} in folder {0} on filesystem {1}.
pt_br: Não é possível criar o arquivo {2}.{3} na pasta {0} do sistema de arquivos {1}.

source: Invalid lock [{0}] for file {1} in {2} with current lock [{3}].
pt_br: Bloqueio [{0}] inválido para arquivo {1} em {2} com bloqueio atual [{3}].

source: Cannot modify filesystem.attributes file:
pt_br: Não é possível modificar o arquivo filesystem.attributes:

source: File {1} cannot be found in folder {0}.
pt_br: O arquivo {1} não pode ser encontrado na pasta {0}.

source: File {2} cannot be locked because it is read-only.
pt_br: O arquivo {2} não pode ser bloqueado porque ele é somente leitura.

source: File {0} does not exist.
pt_br: O arquivo {0} não existe.

source: Cannot read from file {0}.
pt_br: Não é possível ler do arquivo {0}.

source: Error in file {0}.
pt_br: Erro no arquivo {0}.

source: Error in JAR file {1}: {0}
pt_br: Erro no arquivo JAR {1}: {0}

source: Unknown JAR
pt_br: JAR desconhecido

source: Multi-Filesystem
pt_br: Multi-sistema de arquivos

source: File {0} not found.
pt_br: O arquivo "{0}" não foi encontrado.

source: Another application may have moved the file or changed the name.
pt_br: Outra aplicação pode ter movido ou renomeado o arquivo.

source: Invalid XML FileSystem.
pt_br: Sistema de arquivos XML Inválido.

source: Cannot read DefaultAttributes.
pt_br: Não é possível ler DefaultAttributes.

source: Internal error: unreachable code.
pt_br: Erro interno: código inatingível.

source: Folder copying not supported.
pt_br: Cópia de pasta não suportada.

source: FileSystem element must be the root element.
pt_br: O elemento FileSystem precisa ser o elemento raiz.

source: Attribute "name" is missing
pt_br: Está faltando o atributo "nome"

source: Inaccurate number of parameters
pt_br: Número de parâmetros inexato

source: Unknown element.
pt_br: Elemento desconhecido.

source: Duplicated FileObject:
pt_br: FileObject duplicado:

source: {0} in {1}
pt_br: {0} em {1}

source: Dialogs API
pt_br: API de diálogos

source: Handles dialogs and wizards.
pt_br: Manipula caixas de diálogo e assistentes.

source: This module handles the dialog and wizard infrastructure used in NetBeans.
pt_br: Este módulo manipula toda a infra-estrutura de caixas de diálogo e assistentes usada no NetBeans.

source: Error
pt_br: Erro

source: Exception
pt_br: Exceção

source: A {0} exception has occurred.
pt_br: Uma exceção {0} ocorreu.

source: Please report this at http://www.netbeans.org/issues.html, including a copy of your messages.log file.
pt_br: Por favor, relate isto em http://www.netbeans.org/issues.html, incluindo uma cópia do arquivo messages.log.

source: The messages.log file is located in your {1} folder.
pt_br: O arquivo messages.log está localizado na pasta {1}.

source: Unexpected Exception
pt_br: Exceção inesperada

source: Message
pt_br: Mensagem

source: Question
pt_br: Pergunta

source: Information
pt_br: Informação

source: Options Align
pt_br: Alinhamento de opções

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Next >
pt_br: Próximo >

source: {0,choice,1#Moves to next step of the wizard.|2#Next step: {0}.
pt_br: {0,choice,1#Avança para o próximo passo do assistente.|2#Próximo passo: {0}.

source: < &Back
pt_br: < Anterior

source: {0,choice,-1#Moves to previous step of the wizard.|0#Previous step: {0}.
pt_br: {0,choice,-1#Volta ao passo anterior do assistente.|0#Passo anterior: {0}.

source: &Finish
pt_br: &Finalizar

source: Input line
pt_br: Linha de entrada

source: {0} wizard ({1})
pt_br: Assistente {0} ({1})

source: {0} of {1}
pt_br: {0} de {1}

source: Steps
pt_br: Passos

source: Please wait.
pt_br: Aguarde.

source: Window System API
pt_br: API do sistema de janelas

source: API for managing components on a screen.
pt_br: API para gerenciamento de componentes em uma tela.

source: Provides OS and MDI/SDI neutral abstraction API over concept of components that are displayed to the user.
pt_br: Fornece API com abstração neutra de SO e MDI/SDI sobre o conceito de componentes que são exibidos ao usuário.

source: Cannot assign component to EMPTY
pt_br: Não é possível atribuir componente para VAZIO

source: Unknown close operation
pt_br: Operação de fechamento desconhecida

source: Invoking {2} implemented as {3} with {0}
pt_br: Invocando {2} implementado como {3} através de {0}

source: This Computer
pt_br: Este computador

source: might be because your user directory is on a Windows UNC path (issue #46813)?
pt_br: pode ser porque o seu diretório de usuário está em um caminho UNC do Windows (issue #46813)?

source: If so, try using mapped drive letters.
pt_br: Em caso afirmativo, tente usar unidades mapeadas.

source: Master Filesystem
pt_br: Sistema de arquivos mestre

source: Merges multiple filesystem providers into a single logical tree.
pt_br: Une múltiplas fontes de sistemas de arquivos em uma simples árvore lógica.

source: Creates mounts for disk roots and then splices in other filesystems such as VCS mounts, providing a single wrapper FileSystem for them all.
pt_br: Cria montagens para raízes do disco e então divide em outros sistemas de arquivos como se fossem montagens VCS, fornecendo um simples sistema de arquivos empacotador para todas elas.

source: FolderLoader for MasterFileSystem
pt_br: FolderLoader para MasterFileSystem

source: Cannot copy root of filesystem {0}.
pt_br: Não é possível copiar a raís do sistema de arquivos {0}.

source: Cannot move root of filesystem {0}.
pt_br: Não é possível mover a raíz do sistema de arquivos {0}.

source: Filesystem {1} cannot be mounted on the root {0}, because Filesystem {2} is already mounted.
pt_br: O sistema de arquivos {1} não pode ser montado na raiz {0}, porque o sistema de arquivos {2} já está montado.

source: Filesystem {1} cannot be mounted on the root {0}.
pt_br: O sistema de arquivos {1} não pode ser montado na raiz {0}.

source: Filesystem {0} cannot be unmounted.
pt_br: O sistema de arquivos {0} não pôde ser desmontado.

source: Cannot create file {0} in folder {1}.
pt_br: Não é possível criar o arquivo {0} na pasta {1}.

source: This file already exists.
pt_br: Este arquivo já existe.

source: Cannot create folder {0} in folder {1}.
pt_br: Não é possivel criar a pasta {0} na pasta {1}.

source: This folder already exists.
pt_br: Esta pasta já existe.

source: Invalid lock [{0}] for file {1}.
pt_br: Bloqueio inválido [{0}] para o arquivo {1}.

source: Root cannot be locked.
pt_br: A raiz não pode ser bloqueada.

source: Cannot get exclusive access to {0} (probably opened for reading).
pt_br: Não é possível obter acesso exclusivo para {0} (provavelmente aberto para leitura).

source: Cannot get shared access to {0} (probably opened for writing).
pt_br: Não é possível obter acesso compartilhado para {0} (provavelmente aberto para escrita).

source: File {0} is already locked.
pt_br: O arquivo {0} já está bloqueado.

source: File {0} is already locked (lock {1} exists).
pt_br: O arquivo {0} já está bloqueado (bloqueio {1} existe).

source: File {0} cannot be written to because it is read-only.
pt_br: O arquivo {0} não pode ser escrito porque ele é somente leitura.

source: Module System API
pt_br: API do sistema de módulos

source: APIs for getting information about installed modules.
pt_br: APIs para obter informação sobre módulos instalados.

source: Allows to get list of installed modules, inspect their properties and dependencies.
pt_br: Permite obter a lista de módulos instalados, inspecionar suas propriedades e dependências.

source: Utilities API
pt_br: API de utilitários

source: Basic Utilities API.
pt_br: API básica de utilitários

source: Various helper methods and basic concept definitions including actions, lookup, image handling, parallel execution and branding support.
pt_br: Vários métodos auxiliares e definições básicas de determinados conceitos, incluindo ações, lookup, manipulação de imagens, execução paralela e suporte a 'branding'.

source: TOP
pt_br: SUPERIOR

source: LEFT
pt_br: ESQUERDA

source: BOTTOM
pt_br: INFERIOR

source: RIGHT
pt_br: DIREITA

source: CENTER
pt_br: CENTRO

source: NORTH
pt_br: NORTE

source: NORTH_EAST
pt_br: NORDESTE

source: EAST
pt_br: LESTE

source: SOUTH_EAST
pt_br: SUDESTE

source: SOUTH
pt_br: SUL

source: SOUTH_WEST
pt_br: SUDOESTE

source: WEST
pt_br: OESTE

source: NORTH_WEST
pt_br: NOROESTE

source: SINGLE_SELECTION
pt_br: SELEÇÃO_ÚNICA

source: SINGLE_INTERVAL_SELECTION
pt_br: SELEÇÃO_INTERVALO_ÚNICO

source: MULTIPLE_INTERVAL_SELECTION
pt_br: SELEÇÃO_INTERVALO_MÚLTIPLO

source: AUTO_RESIZE_OFF
pt_br: AUTO_REDIMENSIONAMENTO_DESATIVADO

source: AUTO_RESIZE_LAST_COLUMN
pt_br: AUTO_REDIMENSIONAMENTO_ÚLTIMA_COLUNA

source: AUTO_RESIZE_ALL_COLUMNS
pt_br: AUTO_REDIMENSIONAMENTO_TODAS_COLUNAS

source: DO_NOTHING_ON_CLOSE
pt_br: FAZER_NADA_AO_FECHAR

source: HIDE_ON_CLOSE
pt_br: OCULTAR_AO_FECHAR

source: DISPOSE_ON_CLOSE
pt_br: DESCARTAR_AO_FECHAR

source: DEFAULT_OPTION
pt_br: OPÇÃO_PADRÃO

source: YES_NO_OPTION
pt_br: OPÇÃO_SIM_NÃO

source: YES_NO_CANCEL_OPTION
pt_br: OPÇÃO_SIM_NÃO_CANCELAR

source: OK_CANCEL_OPTION
pt_br: OPÇÃO_OK_CANCELAR

source: ERROR_MESSAGE
pt_br: MENSAGEM_ERRO

source: INFORMATION_MESSAGE
pt_br: MENSAGEM_INFORMAÇÃO

source: WARNING_MESSAGE
pt_br: MENSAGEM_AVISO

source: QUESTION_MESSAGE
pt_br: MENSAGEM_QUESTIONAMENTO

source: PLAIN_MESSAGE
pt_br: MENSAGEM_SIMPLES

source: An HTTP server is already registered.
pt_br: Um servidor HTTP já está definido.

source: You cannot use two servers at once.
pt_br: Você não pode utilizar dois servidores ao mesmo tempo.

source: A module attempted to unregister an HTTP server provided by another module.
pt_br: Um módulo tentou cancelar o registro de um servidor HTTP fornecido por outro módulo.

source: to nowhere
pt_br: para lugar nenhum

source: to
pt_br: para

source: No server registered.
pt_br: Nenhum servidor registrado.

source: too many arguments
pt_br: muitos argumentos

source: unmatched braces in the pattern at position
pt_br: chaves não comparável no padrão, na posição

source: object for key {0} was not found
pt_br: o objeto para a chave {0} não foi encontrado

source: ClassFinder already set.
pt_br: ClassFinder já definido.

source: An attempt was made to look up a localized manifest attribute named: {0} This name is in an invalid format.
pt_br: Uma tentativa de consultar um um atributo, localizado no manifesto, chamado: {0} Este nome está em um formato inválido.

source: If you are running the Macintosh MRJ on MacOS X, make sure that your locale settings are valid.
pt_br: Se você está rodando um Macintosh MRJ em um MacOS X, tenha certeza que suas configurações regionais sejam válidas.

source: Currently: {1}
pt_br: Atualmente: {1}

source: WARNING: Cannot load translation table: {0}
pt_br: AVISO: Não pêde carregar a tabela de tradução: {0}

source: Progress cursor
pt_br: Cursor de progresso

source: Multiple Objects Flavor
pt_br: Tipo de objetos múltiplos

source: Create
pt_br: Criar

source: Old Enumeration API
pt_br: Antiga API de enumeração

source: Enumeration API that is in wrong package.
pt_br: API de enumeração que está no pacote errado.

source: Enumeration API that is in wrong package, org.openide.util.enum and as such it cannot be compiled with Java 1.5, because enum is a keyword.
pt_br: API de enumeração a qual encontra-se num pacote incorreto, org.openide.util.enum e então não pode ser compilada com Java 1.5, por enum ser uma palavra reservada.

source: Is replaced by class org.openide.util.Enumerations.
pt_br: Substituída por class org.openide.util.Enumerations.

source: Use org.openide.util.Enumerations instead of this module.
pt_br: Use org.openide.util.Enumerations ao invés deste módulo.

source: Execution API
pt_br: API de execução

source: Execution API from the Open APIs.
pt_br: API de execução das APIs abertas.

source: Consists of parts of the org.openide.execution.* package from the Open APIs.
pt_br: Consiste em partes do pacote org.openide.execution.* das APIs abertas.

source: Settings Options API
pt_br: API das opções de configuração

source: Support for storing preferences.
pt_br: Suporte para armazenar preferências.

source: Provides classes that simplify storage of settings between multiple invocation of NetBeans based application.
pt_br: Fornece classes que simplificam o armazenamento de configurações entre múltiplas invocações de aplicações baseadas no NetBeans.

source: Use org.openide.util.NbPreferences instead.
pt_br: Use preferivelmente org.openide.util.NbPreferences.

source: Exception when invoking property getter on {0}.{1}
pt_br: Exceção enquanto executava o método 'getter' de propriedade em {0}.{1}

source: Nodes API
pt_br: API de nós

source: API for defining generic tree-like structures.
pt_br: API para definição de estruturas genéricas tipo árvore.

source: Provides abstraction over tree-like structures by defining Node - the generic extensible interface that can then be displayed by the Explorer API.
pt_br: Fornece abstração para estruturas tipo árvore pela definição de Nó - a interface genérica extensível que pode então ser exibida pela API do Explorer.

source: Expert
pt_br: Especialista

source: Properties of this object.
pt_br: Propriedades deste objeto.

source: Expert properties of this object.
pt_br: Propriedades especiais deste objeto.

source: Change Order
pt_br: Mudar ordem

source: Show these fields in this order:
pt_br: Exibir esses campos nesta ordem:

source: S
pt_br: x

source: C
pt_br: F

source: Move up
pt_br: Mover para cima

source: U
pt_br: C

source: Move down
pt_br: Mover para baixo

source: Name of the object.
pt_br: Nome do objeto.

source: Paste Node
pt_br: Colar nó

source: Copy Index
pt_br: Copiar índice

source: Please Wait...
pt_br: Aguarde...

source: Text API
pt_br: API de texto

source: Generic API wrapping Swing based EditorKits.
pt_br: API genérica empacotando EditorKits baseandos em swing.

source: Provide support for defining components that embed Swing text editors.
pt_br: Fornece suporte para definição de componentes que incorporam editores de texto swing.

source: Print Settings
pt_br: Configurações de impressão

source: Printing {2} at {1}
pt_br: Imprimindo {2} em {1}

source: Page {0}
pt_br: Página {0}

source: Page Format
pt_br: Formato da página

source: Wrap Lines
pt_br: Quebrar linhas

source: Should lines be wrapped?
pt_br: As linhas devem ser quebradas?

source: Page Header Format
pt_br: Formato do cabeçalho da página

source: For example, "Top of page {0} (printed on date {1}) of file {2}".
pt_br: Por exemplo, "Topo da página {0} (impresso na data {1}) do arquivo {2}".

source: Page Footer Format
pt_br: Formato do rodapé da página

source: For example, "Bottom of page {0} (printed on date {1}) of file {2}".
pt_br: Por exemplo, "Final da página {0} (impresso na data {1}) do arquivo {2}".

source: Page Header Font
pt_br: Fonte do cabeçalho da página

source: Set the page header font.
pt_br: Define a fonte do cabeçalho da página.

source: Page Footer Font
pt_br: Fonte do rodapé da página

source: Set the page footer font.
pt_br: Define a fonte do rodapé da página.

source: Page Header Alignment
pt_br: Alinhamento do cabeçalho da página

source: Page Header Alignment - LEFT, CENTER, RIGHT.
pt_br: Alinhamento do cabeçalho da página - ESQUERDA, CENTRO, DIREITA.

source: Page Footer Alignment
pt_br: Alinhamento do rodapé da página

source: Page Footer Alignment - LEFT, CENTER, RIGHT.
pt_br: Alinhamento do rodapé da página - ESQUERDA, CENTRO, DIREITA.

source: Line Ascent Correction
pt_br: Correção de elevação da linha

source: Multiplier to correct the line ascent.
pt_br: Multiplicador para corrigir a elevação da linha.

source: Page number {0} was printed.
pt_br: A página de número {0} foi impressa.

source: Print Job Progress
pt_br: Progresso da impressão

source: Current printer job was aborted.
pt_br: A impressão atual foi abortada.

source: Printer problem: {0}
pt_br: Problema na impressora: {0}

source: File {0} is read-only.
pt_br: O arquivo {0} é somente leitura.

source: The document {0} could not be loaded.
pt_br: O documento {0} não pôde ser carregado.

source: Save
pt_br: Salvar

source: Discard
pt_br: Descartar

source: Unable to insert empty string
pt_br: Incapaz de inserir uma string vazia

source: Warning: File {0} was not found or could not be accessed.
pt_br: Aviso: O arquivo {0} não foi encontrado ou não pôde ser acessado.

source: File {0} was modified externally.
pt_br: O arquivo {0} foi modificado externamente.

source: Reload it?
pt_br: Recarregá-lo?

source: You have specified an invalid file.
pt_br: Foi especificado um arquivo inválido.

source: Check the path.
pt_br: Verifique o caminho.

source: Editor for {0}
pt_br: Editor para {0}

source: Source
pt_br: Código-fonte
